scc2425-tukano/Tests_Artillery/user_tests.yaml
config:
  target: https://app59457-72394northeurope.azurewebsites.net/rest
  plugins:
    metrics-by-endpoint: {} # Used to get metrics for each endpoint individually.
  processor: ./test-utils.js
  phases:
    - name: "Warm up"    # WARM UP PHASE: duration: 10s, starting with 1 new client/sec up to 5 new clients/sec
      duration: 10
      arrivalRate: 1
      rampTo: 5
    - name: "Main test"    # MAIN TESTS: duration: 30s, with 10 new clients/sec. Should be varied depending on scenario.
      duration: 30
      arrivalRate: 10

scenarios:
  - name: 'Register user'
    weight: 1
    flow:
      - post:
          url: /users/
          headers:
            Content-Type: application/json
            Accept: application/json
          beforeRequest: "uploadRandomizedUser"
          afterResponse: "processRegisterReply"

  - name: 'Get User'
    flow:
      - get:
          url: "/users/{{ userId }}?pwd={{ pwd }}"
          headers:
            Content-Type: application/json
          beforeRequest: "loadUserFromRegistered"

  - name: 'Update User'
    flow:
      - put:
          url: "/users/{{ userId }}?pwd={{pwd}}"
          headers:
            Content-Type: application/json
          beforeRequest: "prepareUpdateUser"
          afterResponse: "processUpdateReply"

  - name: 'Search Users'
    flow:
      - get:
          url: "/users?query={{pattern}}"
          headers:
            Content-Type: application/json
          beforeRequest: "generateSearchPattern"

  - name: 'Delete User'
    flow:
      - delete:
          url: "/users/{{userId}}?pwd={{pwd}}"
          headers:
            Content-Type: application/json
          beforeRequest: "loadUserFromRegistered"
          afterResponse: "processDeleteReply"